nhhxhln/Agent-Indicator/firmware/sdkconfig.defaults
# ESP32-S3-WROOM-1-N16R8
CONFIG_IDF_TARGET="esp32s3"

# Flash 16MB / Octal PSRAM 8MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# 分区表
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# RGB LCD 帧缓冲在 PSRAM,提升带宽稳定性
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y

# WebSocket server(comm_wifi)
CONFIG_HTTPD_WS_SUPPORT=y

# FreeRTOS 1kHz tick,动画引擎用
CONFIG_FREERTOS_HZ=1000

# DevKitC-1:log/下载/REPL 走原生 USB-Serial-JTAG(GPIO19/20)。
# 这样把 GPIO43/44 释放给背光 PWM 与 I2S(见 board.h v0.2)。
# 代价:USB device(TinyUSB vendor/CDC)与 USB-JTAG 互斥,量产二选一。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# LVGL 用 esp 堆(默认内置 TLSF 池仅 64KB,六页 UI 会 OOM 死循环)
CONFIG_LV_USE_CLIB_MALLOC=y

# LVGL:POSIX 文件系统(盘符 A: 映射 VFS 根,可访问 /spiffs 与 /sdcard)+ TinyTTF
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=65
CONFIG_LV_FS_POSIX_PATH=""
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_TINY_TTF_FILE_SUPPORT=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
